Revit 2024 API
SpecTypeId.PipingDensity Property
 Density, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId PipingDensity { get; }
Visual Basic
Public Shared ReadOnly Property PipingDensity As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PipingDensity {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace